Revit 2024 API
ParameterTypeId.BoundaryXTranslationSpring Property
 "X Translation - Spring"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BoundaryXTranslationSpring { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryXTranslationSpring As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BoundaryXTranslationSpring {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace